In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [5]:
data={
    "Nume":["Alina","Bobby","Cristi"],
    "Varsta":[11,22,33],
    "Gen":["F","B","B"],
    "Salariu":[100,2000,30000]
}

df=pd.DataFrame(data)
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nume     3 non-null      object
 1   Varsta   3 non-null      int64
 2   Gen      3 non-null      object
 3   Salariu  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 224.0+ bytes

       Varsta      Salariu
count     3.0      3.00000
mean     22.0  10700.00000
std      11.0  16741.26638
min      11.0    100.00000
25%      16.5   1050.00000
50%      22.0   2000.00000
75%      27.5  16000.00000
max      33.0  30000.00000

In [7]:
type(df['Nume'])
df.Nume

0     Alina
1     Bobby
2    Cristi
Name: Nume, dtype: object

In [10]:
df[['Nume','Gen']]

     Nume Gen
0   Alina   F
1   Bobby   B
2  Cristi   B

In [12]:
df.loc[1,"Varsta"]
df

     Nume  Varsta Gen  Salariu
0   Alina      11   F      100
1   Bobby      22   B     2000
2  Cristi      33   B    30000

In [14]:
df['Nume']=='Alina'

0     True
1    False
2    False
Name: Nume, dtype: bool

In [15]:
df[df['Nume']=='Alina']

    Nume  Varsta Gen  Salariu
0  Alina      11   F      100

In [21]:
df.sort_values(by="Nume",ascending=False)

     Nume  Varsta Gen  Salariu
2  Cristi      33   B    30000
1   Bobby      22   B     2000
0   Alina      11   F      100

In [22]:
df.rename(columns={'Gen':'Sex'})

     Nume  Varsta Sex  Salariu
0   Alina      11   F      100
1   Bobby      22   B     2000
2  Cristi      33   B    30000

In [24]:
df.rename(columns={'Gen':'Sex'},inplace=True)
df

     Nume  Varsta Sex  Salariu
0   Alina      11   F      100
1   Bobby      22   B     2000
2  Cristi      33   B    30000

In [26]:
df['Salariu dublat']=df['Salariu'].apply(lambda x: x*2)
df

     Nume  Varsta Sex  Salariu  Salariu dublat
0   Alina      11   F      100             200
1   Bobby      22   B     2000            4000
2  Cristi      33   B    30000           60000

In [27]:
df['Gen']=df['Sex'].apply(lambda x: "feminin" if x=="F" else "masculin")
df

     Nume  Varsta Sex  Salariu  Salariu dublat       Gen
0   Alina      11   F      100             200   feminin
1   Bobby      22   B     2000            4000  masculin
2  Cristi      33   B    30000           60000  masculin

In [35]:
df['Gen'] = df['Sex'].map({'F': 'feminin', 'B': 'masculin'})

df

     Nume  Varsta Sex  Salariu  Salariu dublat       Gen
0   Alina      11   F      100             200   feminin
1   Bobby      22   B     2000            4000  masculin
2  Cristi      33   B    30000           60000  masculin